<a href="https://colab.research.google.com/github/CamiloLezcanoUdea/ClasesPython20242/blob/master/Clase12-10-2024.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

# 1. Crear un DataFrame

data = {'Name': ['Jhon', 'Ana', 'Pedro', 'Linda'],
        'Age': [28, 24, 35, 32],
        'City': ['Medellin', 'Bogota', 'Cali', 'Barranquilla']}

df = pd.DataFrame(data)
print(df)

    Name  Age          City
0   Jhon   28      Medellin
1    Ana   24        Bogota
2  Pedro   35          Cali
3  Linda   32  Barranquilla

In [ ]:
# 2. Leer archivo CSV
#df2 = pd.read_csv('medicamentos.csv')

In [ ]:
# 3. Seleccionar columnas

print(df['Name'])

0     Jhon
1      Ana
2    Pedro
3    Linda
Name: Name, dtype: object

In [ ]:
# 4. Seleccionar filas con loc y iloc

# crear etiqueta
df['Category'] = df['Age'].apply(lambda x: 'Senior' if x >= 30 else 'Junior')

print(df.loc[df['Category'] == 'Senior']) # valores por etiquetas
print(df.iloc[3]) # valores por indice

    Name  Age          City Category
2  Pedro   35          Cali   Senior
3  Linda   32  Barranquilla   Senior
Name               Linda
Age                   32
City        Barranquilla
Category          Senior
Name: 3, dtype: object

In [ ]:
# 5. filtrar datos

younger_than_30 = df[df['Age'] < 30]
print(younger_than_30)

   Name  Age      City Category
0  Jhon   28  Medellin   Junior
1   Ana   24    Bogota   Junior

In [ ]:
# 6. Estadistica descriptiva

print(df.describe())

             Age
count   4.000000
mean   29.750000
std     4.787136
min    24.000000
25%    27.000000
50%    30.000000
75%    32.750000
max    35.000000

In [22]:
# 7. Agregar nuevas columnas

df['Salary'] = [5000, 6000, 5800, 65000]
df['Currency'] = 'USD'
print(df)

    Name   Age          City  Salary Currency
0   Jhon  28.0      Medellin    5000      USD
1    Ana  24.0        Bogota    6000      USD
2  Pedro  35.0          Cali    5800      USD
3  Linda  32.0  Barranquilla   65000      USD

In [ ]:
# 8. Operaciones con las columnas

df['Tax'] = df['Salary'] * 0.2
print(df)

    Name  Age          City  Salary Currency      Tax
0   Jhon   28      Medellin    5000      USD   1000.0
1    Ana   24        Bogota    6000      USD   1200.0
2  Pedro   35          Cali    5800      USD   1160.0
3  Linda   32  Barranquilla   65000      USD  13000.0

In [ ]:
# 9. Eliminar columnas

df = df.drop('Currency', axis=1)
print(df)

    Name  Age          City  Salary      Tax
0   Jhon   28      Medellin    5000   1000.0
1    Ana   24        Bogota    6000   1200.0
2  Pedro   35          Cali    5800   1160.0
3  Linda   32  Barranquilla   65000  13000.0

In [ ]:
# 10. Agrupar datos

grouped = df.groupby('City')['Age'].mean()
print(grouped)

City
Barranquilla    32.0
Bogota          24.0
Cali            35.0
Medellin        28.0
Name: Age, dtype: float64

In [ ]:
# 11. Manejo de datos nulos

# rellenar una columa con valores nulos
df['Status'] = 'Active'
df.loc[len(df) - 2, 'Status'] = np.nan

df.dropna(inplace=True)
print(df)

    Name  Age          City  Status
0   Jhon   28      Medellin  Active
1    Ana   24        Bogota  Active
2  Pedro   35          Cali     NaN
3  Linda   32  Barranquilla  Active

In [ ]:
# 12. Ordenar datos

df_sorted = df.sort_values(by='Age', ascending=True)
print(df_sorted)

    Name  Age          City  Status
1    Ana   24        Bogota  Active
0   Jhon   28      Medellin  Active
3  Linda   32  Barranquilla  Active
2  Pedro   35          Cali     NaN

In [ ]:
# 13. Exportar DataFrame a CSV

#df.to_csv('exportar.csv', index=False)

In [ ]:
# 14. Unir dataFrames

df3 = pd.DataFrame({'A': ['A0', 'A1', 'A2'], 'B': ['B0', 'B1', 'B2']})
df4 = pd.DataFrame({'A': ['A3', 'A4'], 'B': ['B3', 'B4']})

result = pd.concat([df3, df4], ignore_index=True)
print(result)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [ ]:
# 15.  AÃ±adir funciones con apply

def age_in_days(age):
  return age * 365

df['Age_in_days'] = df['Age'].apply(age_in_days)
print(df)

    Name  Age          City  Status  Age_in_days
0   Jhon   28      Medellin  Active        10220
1    Ana   24        Bogota  Active         8760
2  Pedro   35          Cali     NaN        12775
3  Linda   32  Barranquilla  Active        11680

In [ ]:
# 16. Crear columna con Lambda

df['Category'] = df['Age'].apply(lambda x: 'Senior' if x >= 30 else 'Junior')
print(df)

    Name  Age          City  Status  Age_in_days Category
0   Jhon   28      Medellin  Active        10220   Junior
1    Ana   24        Bogota  Active         8760   Junior
2  Pedro   35          Cali     NaN        12775   Senior
3  Linda   32  Barranquilla  Active        11680   Senior

In [ ]:
# 17. pivot tablas

data_sales = {'City': ['Medellin', 'Bogota', 'Medellin', 'Bogota', 'Medellin', 'Bogota'],
        'Sales': [100, 140, 160, 200, 230, 150],
        'Year': [2020, 2020, 2021, 2021, 2022, 2022]}

df_sales = pd.DataFrame(data_sales)

pivot_table = pd.pivot_table(df_sales, values= 'Sales', index='City', columns='Year', aggfunc='sum')
print(df_sales)
print("--------------------------------------")
print(pivot_table)

       City  Sales  Year
0  Medellin    100  2020
1    Bogota    140  2020
2  Medellin    160  2021
3    Bogota    200  2021
4  Medellin    230  2022
5    Bogota    150  2022
--------------------------------------
Year      2020  2021  2022
City
Bogota     140   200   150
Medellin   100   160   230

In [ ]:
# 18. merge DataFrame

df5 =pd.DataFrame({'Key': ['A', 'B', 'C'], 'value1': [1, 2, 3]})
df6 =pd.DataFrame({'Key': ['A', 'B', 'C'], 'value2': [4, 5, 6]})

merged = pd.merge(df5, df6, on='Key', how='outer')
print(merged)

  Key  value1  value2
0   A       1       4
1   B       2       5
2   C       3       6

In [ ]:
# 19. cambiar el nombre de las columnas

df.rename(columns={'Name': 'Full Name', 'Age': 'Old'}, inplace=True)
print(df)

  Full Name  Old          City  Status  Age_in_days Category
0      Jhon   28      Medellin  Active        10220   Junior
1       Ana   24        Bogota  Active         8760   Junior
2     Pedro   35          Cali     NaN        12775   Senior
3     Linda   32  Barranquilla  Active        11680   Senior

In [ ]:
# 20. Operaciones entre columnas

df['Net_Salary'] = df['Salary'] - (df['Salary'] * 0.2)
print(df)

  Full Name  Old          City  Status  Age_in_days Category  Salary Currency  \
0      Jhon   28      Medellin  Active        10220   Junior    5000      USD
1       Ana   24        Bogota  Active         8760   Junior    6000      USD
2     Pedro   35          Cali     NaN        12775   Senior    5800      USD
3     Linda   32  Barranquilla  Active        11680   Senior   65000      USD

   Net_Salary
0      4000.0
1      4800.0
2      4640.0
3     52000.0

In [5]:
# 21. datos por fechas

date_rng = pd.date_range(start='2022-01-01', end='2022-01-18', freq='D')
df_dates = pd.DataFrame(date_rng, columns=['date'])
df_dates['data'] = pd.Series(range(10))

df_dates.set_index('date', inplace=True)
resampled = df_dates.resample('3D').sum()
print(resampled)

            data
date
2022-01-01   3.0
2022-01-04  12.0
2022-01-07  21.0
2022-01-10   9.0
2022-01-13   0.0
2022-01-16   0.0

In [12]:
# 22. Manejo de tipos de datos

df['Age'] = df['Age'].astype(float)
print(df.dtypes)

Name     object
Age     float64
City     object
dtype: object

In [14]:
# 23. crear dataframe  desde excel xlsx

#df_from_excel = pd.read_excel('data.xlsx', sheet_name='Sheet1')
#print(df_from_excel)

In [15]:
# 24. remover duplicados

df_no_duplicates = df.drop_duplicates(subset='Name')
print(df_no_duplicates)

    Name   Age          City
0   Jhon  28.0      Medellin
1    Ana  24.0        Bogota
2  Pedro  35.0          Cali
3  Linda  32.0  Barranquilla

In [16]:
# 25. indexacion por jerarquia

arrays = [['A', 'A', 'B', 'B'], ['one', 'two', 'one', 'two']]
index = pd.MultiIndex.from_arrays(arrays, names=('Letter', 'Number'))
df_multi = pd.DataFrame({'Values': [10, 20, 30, 40]}, index=index)
print(df_multi)

               Values
Letter Number
A      one         10
       two         20
B      one         30
       two         40

In [20]:
# 26. buscar valores especificos

print(df[df['City'] == 'Medellin'])

   Name   Age      City
0  Jhon  28.0  Medellin

In [23]:
# 27. calculos acumulativos

df['Cumulative_Salary'] = df['Salary'].cumsum()
print(df)

    Name   Age          City  Salary Currency  Cumulative_Salary
0   Jhon  28.0      Medellin    5000      USD               5000
1    Ana  24.0        Bogota    6000      USD              11000
2  Pedro  35.0          Cali    5800      USD              16800
3  Linda  32.0  Barranquilla   65000      USD              81800

In [24]:
# 28. correlaciones

print(df[['Age', 'Salary']].corr())

             Age    Salary
Age     1.000000  0.312838
Salary  0.312838  1.000000

In [25]:
# 29. mostrar cantidad limitada de filas

print(df.head(2))
print(df.tail(2))

   Name   Age      City  Salary Currency  Cumulative_Salary
0  Jhon  28.0  Medellin    5000      USD               5000
1   Ana  24.0    Bogota    6000      USD              11000
    Name   Age          City  Salary Currency  Cumulative_Salary
2  Pedro  35.0          Cali    5800      USD              16800
3  Linda  32.0  Barranquilla   65000      USD              81800